Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_85 (Conv2D)           (None, 224, 224, 32)      896       
_________________________________________________________________
leaky_re_lu_119 (LeakyReLU)  (None, 224, 224, 32)      0         
_________________________________________________________________
batch_normalization_119 (Bat (None, 224, 224, 32)      128       
_________________________________________________________________
max_pooling2d_65 (MaxPooling (None, 112, 112, 32)      0         
_________________________________________________________________
conv2d_86 (Conv2D)           (None, 112, 112, 64)      18496     
_________________________________________________________________
leaky_re_lu_120 (LeakyReLU)  (None, 112, 112, 64)      0         
_________________________________________________________________
batch_normalization_120 (Bat (None, 112, 112, 64)      256       
_________________________________________________________________
max_pooling2d_66 (MaxPooling (None, 56, 56, 64)        0         
_________________________________________________________________
conv2d_87 (Conv2D)           (None, 56, 56, 128)       73856     
_________________________________________________________________
leaky_re_lu_121 (LeakyReLU)  (None, 56, 56, 128)       0         
_________________________________________________________________
batch_normalization_121 (Bat (None, 56, 56, 128)       512       
_________________________________________________________________
max_pooling2d_67 (MaxPooling (None, 28, 28, 128)       0         
_________________________________________________________________
conv2d_88 (Conv2D)           (None, 28, 28, 256)       295168    
_________________________________________________________________
leaky_re_lu_122 (LeakyReLU)  (None, 28, 28, 256)       0         
_________________________________________________________________
batch_normalization_122 (Bat (None, 28, 28, 256)       1024      
_________________________________________________________________
max_pooling2d_68 (MaxPooling (None, 9, 9, 256)         0         
_________________________________________________________________
conv2d_89 (Conv2D)           (None, 9, 9, 512)         1180160   
_________________________________________________________________
batch_normalization_123 (Bat (None, 9, 9, 512)         2048      
_________________________________________________________________
leaky_re_lu_123 (LeakyReLU)  (None, 9, 9, 512)         0         
_________________________________________________________________
max_pooling2d_69 (MaxPooling (None, 3, 3, 512)         0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 4608)              0         
_________________________________________________________________
dense_51 (Dense)             (None, 512)               2359808   
_________________________________________________________________
leaky_re_lu_124 (LeakyReLU)  (None, 512)               0         
_________________________________________________________________
batch_normalization_124 (Bat (None, 512)               2048      
_________________________________________________________________
dropout_34 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_52 (Dense)             (None, 128)               65664     
_________________________________________________________________
leaky_re_lu_125 (LeakyReLU)  (None, 128)               0         
_________________________________________________________________
batch_normalization_125 (Bat (None, 128)               512       
_________________________________________________________________
dropout_35 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_53 (Dense)             (None, 7)                 903       
_________________________________________________________________
activation_17 (Activation)   (None, 7)                 0         
=================================================================
Total params: 4,001,479
Trainable params: 3,998,215
Non-trainable params: 3,264
_________________________________________________________________